using UnityEngine;
using UnityEditor;
using System.Collections;
/*===============================================================*/
/**
* ポップアップウィンドウ
* 2014年12月25日 Buravo
*/ 
public class PopupWindow : EditorWindow 
{
    #region パブリック変数
    /*===============================================================*/
    /**
    * @brief YES用の処理を使うためのデリゲート宣言
    */
    public delegate void Callback(bool t_init);
    /**
    * @brief YES用の処理を使うためのデリゲート変数
    */
    public Callback callBack;
    /*===============================================================*/
    #endregion

    #region メンバ変数
    /*===============================================================*/
    /**
    * @brief 表示するテキスト
    */
    private string m_text;
    /*===============================================================*/
    #endregion

    #region アクセサ
    /*===============================================================*/
    /**
    * @brief 表示するテキスト
    */
    public string Text
    {
        set
        {
            m_text = value;
        }
        get
        {
            return m_text;
        }
    }
    /*===============================================================*/
    #endregion
 
    /*===============================================================*/
    /**
    * @brief 初期化処理
    */
    static void Init () 
    {
    }
    /*===============================================================*/

    /*===============================================================*/
    /**
    * @brief ウィンドウ表示時に自動で呼ばれるメソッド。
    */ 
    void OnEnable () 
    {
    }
    /*===============================================================*/

    /*===============================================================*/
    /**
    * @brief 選択内容の変更時に自動で呼ばれるメソッド。
    */
    void OnSelectionChange () 
    {
    }
    /*===============================================================*/

    /*===============================================================*/
    /**
    * @brief GUI表示処理
    */
    void OnGUI () 
    {
        try 
        {
            GUILayout.Label(m_text, EditorStyles.boldLabel);
            // 座標の初期化.
            if (GUILayout.Button("Yes"))
            {
                callBack(true);
                this.Close();
            }
            // オブジェクトの生成.
            if (GUILayout.Button("No"))
            {
                this.Close();
            }
        } 
        catch (System.FormatException) 
        {
        }
    }
    /*===============================================================*/

    /*===============================================================*/
    /**
    * @brief インスペクタ更新処理
    */
    void OnInspectorUpdate ()
    {
        Repaint();
    }
    /*===============================================================*/
}
/*===============================================================*/